{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.2.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [1, 240, 320, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.0.0_padding", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "basenet.0.0_padding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.0.0_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.0.0_conv", "inbound_nodes": [[["basenet.0.0_padding", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.0.1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.0.1_bn", "inbound_nodes": [[["basenet.0.0_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.0.2_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.0.2_relu", "inbound_nodes": [[["basenet.0.1_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.1.0_padding", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "basenet.1.0_padding", "inbound_nodes": [[["basenet.0.2_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "basenet.1.0_dconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "basenet.1.0_dconv", "inbound_nodes": [[["basenet.1.0_padding", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.1.1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.1.1_bn", "inbound_nodes": [[["basenet.1.0_dconv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.1.2_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.1.2_relu", "inbound_nodes": [[["basenet.1.1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.1.3_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.1.3_conv", "inbound_nodes": [[["basenet.1.2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.1.4_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.1.4_bn", "inbound_nodes": [[["basenet.1.3_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.1.5_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.1.5_relu", "inbound_nodes": [[["basenet.1.4_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.2.0_padding", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "basenet.2.0_padding", "inbound_nodes": [[["basenet.1.5_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "basenet.2.0_dconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "basenet.2.0_dconv", "inbound_nodes": [[["basenet.2.0_padding", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.2.1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.2.1_bn", "inbound_nodes": [[["basenet.2.0_dconv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.2.2_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.2.2_relu", "inbound_nodes": [[["basenet.2.1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.2.3_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.2.3_conv", "inbound_nodes": [[["basenet.2.2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.2.4_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.2.4_bn", "inbound_nodes": [[["basenet.2.3_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.2.5_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.2.5_relu", "inbound_nodes": [[["basenet.2.4_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.3.0_padding", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "basenet.3.0_padding", "inbound_nodes": [[["basenet.2.5_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "basenet.3.0_dconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "basenet.3.0_dconv", "inbound_nodes": [[["basenet.3.0_padding", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.3.1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.3.1_bn", "inbound_nodes": [[["basenet.3.0_dconv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.3.2_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.3.2_relu", "inbound_nodes": [[["basenet.3.1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.3.3_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.3.3_conv", "inbound_nodes": [[["basenet.3.2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.3.4_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.3.4_bn", "inbound_nodes": [[["basenet.3.3_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.3.5_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.3.5_relu", "inbound_nodes": [[["basenet.3.4_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.4.0_padding", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "basenet.4.0_padding", "inbound_nodes": [[["basenet.3.5_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "basenet.4.0_dconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "basenet.4.0_dconv", "inbound_nodes": [[["basenet.4.0_padding", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.4.1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.4.1_bn", "inbound_nodes": [[["basenet.4.0_dconv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.4.2_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.4.2_relu", "inbound_nodes": [[["basenet.4.1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.4.3_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.4.3_conv", "inbound_nodes": [[["basenet.4.2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.4.4_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.4.4_bn", "inbound_nodes": [[["basenet.4.3_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.4.5_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.4.5_relu", "inbound_nodes": [[["basenet.4.4_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.5.0_padding", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "basenet.5.0_padding", "inbound_nodes": [[["basenet.4.5_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "basenet.5.0_dconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "basenet.5.0_dconv", "inbound_nodes": [[["basenet.5.0_padding", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.5.1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.5.1_bn", "inbound_nodes": [[["basenet.5.0_dconv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.5.2_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.5.2_relu", "inbound_nodes": [[["basenet.5.1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.5.3_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.5.3_conv", "inbound_nodes": [[["basenet.5.2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.5.4_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.5.4_bn", "inbound_nodes": [[["basenet.5.3_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.5.5_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.5.5_relu", "inbound_nodes": [[["basenet.5.4_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.6.0_padding", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "basenet.6.0_padding", "inbound_nodes": [[["basenet.5.5_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "basenet.6.0_dconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "basenet.6.0_dconv", "inbound_nodes": [[["basenet.6.0_padding", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.6.1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.6.1_bn", "inbound_nodes": [[["basenet.6.0_dconv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.6.2_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.6.2_relu", "inbound_nodes": [[["basenet.6.1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.6.3_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.6.3_conv", "inbound_nodes": [[["basenet.6.2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.6.4_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.6.4_bn", "inbound_nodes": [[["basenet.6.3_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.6.5_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.6.5_relu", "inbound_nodes": [[["basenet.6.4_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.7.branch2.0_conv", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.7.branch2.0_conv", "inbound_nodes": [[["basenet.6.5_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.7.branch2.0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.7.branch2.0_bn", "inbound_nodes": [[["basenet.7.branch2.0_conv", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.7.branch2.1_padding", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "basenet.7.branch2.1_padding", "inbound_nodes": [[["basenet.7.branch2.0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.7.branch2.1_conv", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.7.branch2.1_conv", "inbound_nodes": [[["basenet.7.branch2.1_padding", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.7.branch0.0_conv", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.7.branch0.0_conv", "inbound_nodes": [[["basenet.6.5_relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.7.branch1.0_conv", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.7.branch1.0_conv", "inbound_nodes": [[["basenet.6.5_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.7.branch2.1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.7.branch2.1_bn", "inbound_nodes": [[["basenet.7.branch2.1_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.7.branch0.0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.7.branch0.0_bn", "inbound_nodes": [[["basenet.7.branch0.0_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.7.branch1.0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.7.branch1.0_bn", "inbound_nodes": [[["basenet.7.branch1.0_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.7.branch2.1_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.7.branch2.1_relu", "inbound_nodes": [[["basenet.7.branch2.1_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.7.branch0.1_padding", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "basenet.7.branch0.1_padding", "inbound_nodes": [[["basenet.7.branch0.0_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.7.branch1.1_padding", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "basenet.7.branch1.1_padding", "inbound_nodes": [[["basenet.7.branch1.0_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.7.branch2.2_padding", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "basenet.7.branch2.2_padding", "inbound_nodes": [[["basenet.7.branch2.1_relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.7.branch0.1_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.7.branch0.1_conv", "inbound_nodes": [[["basenet.7.branch0.1_padding", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.7.branch1.1_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.7.branch1.1_conv", "inbound_nodes": [[["basenet.7.branch1.1_padding", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.7.branch2.2_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.7.branch2.2_conv", "inbound_nodes": [[["basenet.7.branch2.2_padding", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.7.branch0.1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.7.branch0.1_bn", "inbound_nodes": [[["basenet.7.branch0.1_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.7.branch1.1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.7.branch1.1_bn", "inbound_nodes": [[["basenet.7.branch1.1_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.7.branch2.2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.7.branch2.2_bn", "inbound_nodes": [[["basenet.7.branch2.2_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.7.branch0.1_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.7.branch0.1_relu", "inbound_nodes": [[["basenet.7.branch0.1_bn", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.7.branch1.1_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.7.branch1.1_relu", "inbound_nodes": [[["basenet.7.branch1.1_bn", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.7.branch2.2_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.7.branch2.2_relu", "inbound_nodes": [[["basenet.7.branch2.2_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.7.branch0.2_padding", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "basenet.7.branch0.2_padding", "inbound_nodes": [[["basenet.7.branch0.1_relu", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.7.branch1.2_padding", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "basenet.7.branch1.2_padding", "inbound_nodes": [[["basenet.7.branch1.1_relu", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.7.branch2.3_padding", "trainable": true, "dtype": "float32", "padding": [[5, 5], [5, 5]], "data_format": "channels_last"}, "name": "basenet.7.branch2.3_padding", "inbound_nodes": [[["basenet.7.branch2.2_relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.7.branch0.2_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [2, 2], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.7.branch0.2_conv", "inbound_nodes": [[["basenet.7.branch0.2_padding", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.7.branch1.2_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [3, 3], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.7.branch1.2_conv", "inbound_nodes": [[["basenet.7.branch1.2_padding", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.7.branch2.3_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [5, 5], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.7.branch2.3_conv", "inbound_nodes": [[["basenet.7.branch2.3_padding", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.7.branch0.2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.7.branch0.2_bn", "inbound_nodes": [[["basenet.7.branch0.2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.7.branch1.2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.7.branch1.2_bn", "inbound_nodes": [[["basenet.7.branch1.2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.7.branch2.3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.7.branch2.3_bn", "inbound_nodes": [[["basenet.7.branch2.3_conv", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "basenet.7_cat", "trainable": true, "dtype": "float32", "axis": -1}, "name": "basenet.7_cat", "inbound_nodes": [[["basenet.7.branch0.2_bn", 0, 0, {}], ["basenet.7.branch1.2_bn", 0, 0, {}], ["basenet.7.branch2.3_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.7.convlinear_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.7.convlinear_conv", "inbound_nodes": [[["basenet.7_cat", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.7.convlinear_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.7.convlinear_bn", "inbound_nodes": [[["basenet.7.convlinear_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.7.shortcut_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.7.shortcut_conv", "inbound_nodes": [[["basenet.6.5_relu", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply", "inbound_nodes": [["basenet.7.convlinear_bn", 0, 0, {"y": 1.0, "name": "basenet.7_mul"}]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.7.shortcut_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.7.shortcut_bn", "inbound_nodes": [[["basenet.7.shortcut_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "basenet.7_add", "trainable": true, "dtype": "float32"}, "name": "basenet.7_add", "inbound_nodes": [[["tf.math.multiply", 0, 0, {}], ["basenet.7.shortcut_bn", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.7_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.7_relu", "inbound_nodes": [[["basenet.7_add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.8.0_padding", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "basenet.8.0_padding", "inbound_nodes": [[["basenet.7_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "basenet.8.0_dconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "basenet.8.0_dconv", "inbound_nodes": [[["basenet.8.0_padding", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.8.1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.8.1_bn", "inbound_nodes": [[["basenet.8.0_dconv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.8.2_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.8.2_relu", "inbound_nodes": [[["basenet.8.1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.8.3_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.8.3_conv", "inbound_nodes": [[["basenet.8.2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.8.4_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.8.4_bn", "inbound_nodes": [[["basenet.8.3_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.8.5_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.8.5_relu", "inbound_nodes": [[["basenet.8.4_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.9.0_padding", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "basenet.9.0_padding", "inbound_nodes": [[["basenet.8.5_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "basenet.9.0_dconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "basenet.9.0_dconv", "inbound_nodes": [[["basenet.9.0_padding", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.9.1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.9.1_bn", "inbound_nodes": [[["basenet.9.0_dconv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.9.2_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.9.2_relu", "inbound_nodes": [[["basenet.9.1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "basenet.9.3_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "basenet.9.3_conv", "inbound_nodes": [[["basenet.9.2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.9.4_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "basenet.9.4_bn", "inbound_nodes": [[["basenet.9.3_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "basenet.9.5_relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "basenet.9.5_relu", "inbound_nodes": [[["basenet.9.4_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "basenet.10.0_padding", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "basenet.10.0_padding", "inbound_nodes": [[["basenet.9.5_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "basenet.10.0_dconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "basenet.10.0_dconv", "inbound_nodes": [[["basenet.10.0_padding", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "basenet.10.1_bn", "trainable": true, "dtype": 